function lab(input) {
  let w = Number(input[0]);
  let h = Number(input[1]);
  // Преобразуване на ширината и височината в сантиметри
  let wToSm = 100 * w;
  let hToSm = 100 * h;

  //В конкретния контекст на кода,
  //Math.floor() се използва за изчисляване на броя на
  //колоните (бюра) и редовете (места за сядане).
  //Това се прави, за да се гарантира,
  //че резултатът представлява цяло число
  //и отговаря на реалните размери на залата
  //без излишни дробни части.

  // Изчисление на броя колони (бюра)
  let wToColoms = Math.floor(wToSm / 120);
  // Изчисление на броя редове (места за сядане)
  let hToSeats = Math.floor((hToSm - 100) / 70);
  // Изчисление на общия брой работни места
  let hPerW = hToSeats * wToColoms;
  // Изваждаме 3 работни места (за вратата и катедрата)
  let totalSeats = hPerW - 3;

  console.log(Math.round(totalSeats).toFixed(2));
}

lab(["15", "8.9"]); // Изход: 129.00
lab(["8.4", "5.2"]); // Изход: 39.00
